Repository: wwsh123/XrayUI
Catalog: Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# MainWindow_Title
source: Proxy Panel
zh_cn: 代理控制台

# MainWindow_ToggleMini
source: Toggle mini window
zh_cn: 切换mini窗口

# MainWindow_ExpandFull
source: Back to full window
zh_cn: 返回完整窗口

# MainWindow_Close
source: Close
zh_cn: 关闭

# Tray_Open
source: Show App
zh_cn: 打开窗口

# Tray_Exit
source: Quit
zh_cn: 退出

# Tray_TooltipIdle
source: XrayUI - Idle
zh_cn: XrayUI - 未连接

# ServerList_Edit
source: Edit
zh_cn: 编辑

# ServerList_Delete
source: Delete
zh_cn: 删除

# ServerList_Share
source: Share
zh_cn: 分享

# ServerList_SortActiveHint
source: Only available when filter is "All Servers"
zh_cn: 只在筛选为「所有服务器」时可用

# ServerList_AllServers
source: All Servers
zh_cn: 所有服务器

# ServerList_Ungrouped
source: Ungrouped
zh_cn: 未分组

# ServerList_UnnamedSub
source: (Unnamed Subscription)
zh_cn: (未命名订阅)

# ServerList_OrphanSub
source: (Deleted Subscription)
zh_cn: (已删除订阅)

# ControlPanel_Start
source: Start
zh_cn: 启动

# ControlPanel_Stop
source: Stop
zh_cn: 停止

# ControlPanel_StatusNotRunning
source: Idle
zh_cn: 未运行

# ControlPanel_StatusApplying
source: Applying...
zh_cn: 正在应用...

# ControlPanel_Personalize
source: Personalize
zh_cn: 个性化

# ControlPanel_RoutingGlobal
source: Global
zh_cn: 全局路由

# ControlPanel_RoutingSmart
source: Smart
zh_cn: 智能分流

# ControlPanel_UpdateFound
source: New version {0}
zh_cn: 发现新版本 {0}

# ServerDetail_Address
source: Address
zh_cn: 地址

# ServerDetail_Port
source: Port
zh_cn: 端口

# ServerDetail_Encryption
source: Encryption
zh_cn: 加密

# ServerDetail_Security
source: Security
zh_cn: 安全

# ServerDetail_OpenInBrowser
source: Open {0} in browser
zh_cn: 在浏览器中打开 {0}

# ServerDetail_RetestLatency
source: Retest latency
zh_cn: 重新测试延迟

# ServerDetail_CopyShareLink
source: Copy share link
zh_cn: 复制分享链接

# ServerDetail_NoServer
source: No server selected
zh_cn: 未选择服务器

# ServerDetail_NotTested
source: Not tested
zh_cn: 未测试

# ServerDetail_Testing
source: Testing...
zh_cn: 测试中...

# ServerDetail_Timeout
source: Timeout
zh_cn: 超时

# ServerDetail_Failed
source: Failed
zh_cn: 失败

# Personalize_Header.Text
source: Personalization
zh_cn: 个性化设置

# Personalize_Theme.Text
source: Theme
zh_cn: 主题

# Personalize_Light.Content
source: Light
zh_cn: 浅色

# Personalize_Dark.Content
source: Dark
zh_cn: 深色

# Personalize_FollowSystem.Content
source: System
zh_cn: 跟随系统

# Personalize_Backdrop.Text
source: Background Effect
zh_cn: 背景效果

# Personalize_Acrylic.Content
source: Acrylic
zh_cn: 亚克力

# Personalize_ProtocolColors.Text
source: Protocol Colors
zh_cn: 协议颜色

# Personalize_Reset.Text
source: Reset
zh_cn: 重置

# Personalize_OtherProtocol.Text
source: Other Protocols
zh_cn: 其他协议

# Personalize_OtherProtocolDesc.Text
source: Unmatched protocols will use this color
zh_cn: 未匹配的协议将使用此颜色

# Personalize_DataManagement.Text
source: Import & Export
zh_cn: 数据管理

# Personalize_Done.Content
source: Done
zh_cn: 完成

# Personalize_ExportSuccess
source: Export Successful
zh_cn: 导出成功

# Language_FollowSystem
source: Follow System
zh_cn: 跟随系统

# Subscription_AddTooltip
source: Add Subscription
zh_cn: 添加订阅

# Subscription_ManageTooltip
source: Manage Subscriptions
zh_cn: 管理订阅

# Subscription_Refresh
source: Refresh Subscription
zh_cn: 刷新订阅

# Subscription_DeleteTooltip
source: Delete Subscription
zh_cn: 删除订阅

# Subscription_EditTooltip
source: Edit Subscription
zh_cn: 编辑订阅

source: Subscription fetch failed
zh_cn: 订阅拉取失败

# Subscription_NoParsed
source: No valid nodes could be parsed from the subscription.
zh_cn: 未能从订阅中解析出任何有效节点。

# Subscription_UpdateFailed
source: Update failed: {0}
zh_cn: 更新失败: {0}

# Subscription_StopFirst_Delete
source: Please stop the proxy before deleting
zh_cn: 请先停止代理后再删除

# CustomRules_Title
source: Custom Routing Rules
zh_cn: 自定义路由规则

# AddRule_Title
source: Add Rule
zh_cn: 添加规则

# AddRule_ErrorEmpty
source: Please enter match content
zh_cn: 请填写匹配内容

# Log_Title
source: Proxy Log
zh_cn: 代理日志

# Log_NotRunning
source: Not running
zh_cn: 未运行

# Log_Running
source: Running
zh_cn: 运行中

# Log_Lines
source: ({0} lines)
zh_cn: ({0} 行)

# Log_PrivacyTooltip
source: Log settings
zh_cn: 日志设置

# Log_IpMask
source: IP Address Mask
zh_cn: IP地址遮罩

# Log_MaskOff
source: Off
zh_cn: 关闭

source: Log Level
zh_cn: 日志级别

# Log_DnsLog
source: DNS Query Log
zh_cn: DNS 查询日志

# Log_DnsLogOn
source: On
zh_cn: 开启

# Log_AutoScroll
source: Auto Scroll
zh_cn: 自动滚动

# Log_CopyAll
source: Copy All
zh_cn: 复制全部

# Log_Clear
source: Clear
zh_cn: 清除

# Log_PrivacyTitle
source: Log Privacy Settings
zh_cn: 日志隐私设置

# Log_PrivacySaved
source: Saved. Takes effect on next TUN session start.
zh_cn: 已保存，当前 TUN 会话下次启动时生效。

# Log_PrivacyFailed
source: Save failed: {0}
zh_cn: 保存失败：{0}

# Dialog_OK
source: OK
zh_cn: 确定

# Dialog_Cancel
source: Cancel
zh_cn: 取消

# Dialog_Save
source: Save
zh_cn: 保存

# Dialog_Done
source: Done
zh_cn: 完成

# Dialog_Confirm
source: Confirm
zh_cn: 确认

# Dialog_Add
source: Add
zh_cn: 添加

# Dialog_Delete
source: Delete
zh_cn: 删除

# Dialog_Replace
source: Replace
zh_cn: 替换

# Dialog_Preparing
source: Preparing…
zh_cn: 正在准备…

# Dialog_On
source: On
zh_cn: 开

# Dialog_Off
source: Off
zh_cn: 关

# Import_Placeholder
source: Paste node links (multi-protocol supported)
zh_cn: 粘贴节点链接（支持多协议）

# Import_Title
source: Import Node Links
zh_cn: 导入节点链接

# Import_SupportHint
source: Supports common protocol links
zh_cn: 支持常见协议链接

# Import_ParseFailed
source: Parse Failed
zh_cn: 解析失败

# Import_ParseFailedMsg
source: No valid node links found. Please verify your input and try again.
zh_cn: 无法识别有效的节点链接，请检查后重试。

# Import_ClipboardEmptyTitle
source: Clipboard Empty
zh_cn: 剪贴板为空

# Import_ClipboardEmptyMsg
source: No valid content found in the clipboard.
zh_cn: 未在剪贴板中检测到有效内容。

# EditServer_AddTitle
source: Add Server Manually
zh_cn: 手动添加服务器

# EditServer_EditTitle
source: Edit Server
zh_cn: 编辑服务器

# EditServer_Name
source: Name
zh_cn: 名称

# EditServer_Address
source: Address / Domain
zh_cn: 地址 / 域名

# EditServer_Port
source: Port
zh_cn: 端口

# EditServer_Protocol
source: Protocol
zh_cn: 协议

# EditServer_Encryption
source: Encryption (SS)
zh_cn: 加密方式 (SS)

# EditServer_Password
source: Password
zh_cn: 密码

# EditServer_ShowPassword
source: Show password
zh_cn: 显示密码

# EditServer_HidePassword
source: Hide password
zh_cn: 隐藏密码

# EditServer_Transport
source: Transport Protocol
zh_cn: 传输协议

# EditServer_Path
source: Path (WS/gRPC/XHTTP)
zh_cn: 路径 (WS/gRPC/XHTTP)

# EditServer_WsHost
source: Host Header (WS/XHTTP)
zh_cn: Host 头 (WS/XHTTP)

# EditServer_Security
source: Security
zh_cn: 安全

# EditServer_Fingerprint
source: Fingerprint (uTLS)
zh_cn: 指纹 (uTLS)

# EditServer_AllowInsecure
source: Allow insecure connection (skip certificate verification)
zh_cn: 允许不安全连接（跳过证书校验）

# EditServer_CertFingerprint
source: Certificate fingerprint (SHA-256)
zh_cn: 证书指纹 (SHA-256)

# EditServer_FlowPlaceholder
source: xtls-rprx-vision or leave empty
zh_cn: xtls-rprx-vision 或留空

# EditPort_Title
source: Edit Local Port
zh_cn: 编辑本地端口

# EditPort_Header
source: Local Port
zh_cn: 本地端口

# EditPort_Range
source: Range: {0} - {1}
zh_cn: 有效范围：{0} - {1}

# EditPort_AllowLan
source: Allow LAN connections
zh_cn: 允许局域网设备连接

# EditPort_LanAddress
source: LAN address: {0}
zh_cn: 局域网地址：{0}

# EditPort_LanUnavailable
source: No LAN network detected
zh_cn: 未检测到可用的局域网网络

# EditPort_CopyAddress
source: Copy Address
zh_cn: 复制地址

# Share_Title
source: Share Node
zh_cn: 分享节点

# Share_CopyLink
source: Copy Link
zh_cn: 复制链接

# Share_NotSupported
source: Sharing Not Supported
zh_cn: 不支持分享

# Share_NotSupportedMsg
source: This node protocol does not support generating share links.
zh_cn: 该节点协议暂不支持生成分享链接。

# Startup_Title
source: Startup
zh_cn: 开机启动

# Startup_AutoStart
source: Launch at startup
zh_cn: 开机自动启动

# Startup_AutoConnect
source: Auto-connect to last node
zh_cn: 自动连接上次节点

# Startup_SetFailed
source: Startup settings failed
zh_cn: 开机启动设置失败

# Startup_RestoreProxyStateOnStartup
source: Restore proxy state on startup
zh_cn: 启动时恢复上次代理状态

# Startup_RestoreProxyStateOnStartupDesc
source: Automatically restore the running state of the primary and auxiliary proxies from when the app was last closed
zh_cn: 如果退出软件时代理正在运行，下次启动将自动恢复主代理及已启用的辅助代理

# Confirm_DeleteTitle
source: Confirm Delete
zh_cn: 确认删除

# Confirm_DeleteMsg
source: Are you sure you want to delete {0}?
zh_cn: 确定要删除 {0}?

# Confirm_ReplaceTitle
source: Replace current configuration?
zh_cn: 替换当前配置?

# Confirm_ReplaceMsg
source: This will overwrite all current servers and routing rules. We strongly recommend exporting a backup first. Continue?
zh_cn: 此操作将覆盖您当前的全部节点和路由规则,强烈建议先导出备份。是否继续?

# EditServer_SocksUsername
source: Username
zh_cn: 用户名

# EditServer_EchPlaceholder
source: e.g. udp://1.1.1.1 or server-generated ECHConfig
zh_cn: 例如 udp://1.1.1.1 或服务端生成的 ECHConfig

# EditServer_FinalmaskPlaceholder
source: Empty = none; or mlkem768x25519plus.native.0rtt...
zh_cn: 留空 = none;或 mlkem768x25519plus.native.0rtt....

# ChainProxy_AddTitle
source: Add Chain Proxy
zh_cn: 链式代理

# ChainProxy_EditTitle
source: Edit Chain Proxy
zh_cn: 编辑链式代理

# Dns_DialogTitle
source: DNS Settings
zh_cn: DNS 设置

# ControlPanel_DnsItem.Text
source: DNS Settings
zh_cn: DNS设置

# Dns_ResetDefaults
source: Reset to defaults
zh_cn: 重置默认

# Dns_ServerPlaceholder
source: Enter IP or DoH address (empty = auto)
zh_cn: 输入 IP 或 DoH 地址 (留空为自动)

# Dns_QueryStrategyLabel
source: Query strategy
zh_cn: 查询策略

# Dns_EnableCacheLabel
source: Enable DNS cache
zh_cn: 启用 DNS 缓存

# Dns_DirectTitle
source: Direct DNS
zh_cn: 直连 DNS

# Dns_DirectDesc
source: For domestic domains (geosite:cn), resolved directly without proxy
zh_cn: 用于国内域名 (geosite:cn)，走直连出站解析

# Dns_ProxyTitle
source: Proxy DNS
zh_cn: 代理 DNS

# Dns_ProxyDesc
source: For foreign domains, resolved via proxy outbound to prevent DNS hijacking
zh_cn: 用于境外域名，经代理出站解析，防止 DNS 污染

# Dns_TunOnlyHint
source: TUN mode only
zh_cn: 仅TUN模式有效

# Dns_Experimental
source: Experimental
zh_cn: 实验性

# Dns_Provider_Ali
source: Alibaba
zh_cn: 阿里

# Dns_Provider_Tencent
source: Tencent
zh_cn: 腾讯

# Dns_Provider_Google
source: Google
zh_cn: 谷歌

# Dns_Strategy_V4Only
source: IPv4 only
zh_cn: 仅 IPv4

# Dns_Strategy_V6Only
source: IPv6 only
zh_cn: 仅 IPv6

# Dns_Strategy_Auto
source: Auto
zh_cn: 自动

# Error_NoServer
source: No Server Selected
zh_cn: 未选择服务器

# Error_NoServerMsg
source: Please select a server from the list first
zh_cn: 请先从列表中选择服务器

# Error_StartFailed
source: Start Failed
zh_cn: 启动失败

# Error_XrayStartFailed
source: xray failed to start. Please check server configuration.
zh_cn: xray 启动失败. 请检查服务器配置.

# Error_ReapplyFailed
source: Apply Configuration Failed
zh_cn: 应用新配置失败

# Error_XrayReapplyFailed
source: xray failed to apply new configuration and has stopped.
zh_cn: xray 应用新配置失败，已停止。

# Error_UpdateFailed
source: Update Failed
zh_cn: 更新失败

# Error_UpdaterLaunchFailed
source: Could not launch updater: {0}
zh_cn: 无法启动升级器：{0}

# Update_Updating
source: Updating XrayUI
zh_cn: 正在更新 XrayUI

# Update_ConfirmTitle
source: XrayUI {0} is available
zh_cn: XrayUI {0} 已发布

# Update_ConfirmNotesHeader
source: What's new
zh_cn: 更新内容

# Update_ChangelogLanguage
source: en
zh_cn: zh

# Update_ConfirmNow
source: Update now
zh_cn: 立即更新

# Update_ConfirmLater
source: Later
zh_cn: 稍后

# Tun_EnableTitle
source: Enable TUN Mode
zh_cn: 开启TUN模式

# Tun_EnableMsg.Text
source: Enabling TUN mode requires administrator privileges. The app will restart. Continue?
zh_cn: 开启虚拟网卡模式需要管理员权限，程序将会重启，是否继续？

# Main_NoSelection
source: Not selected
zh_cn: 未选择

# Main_NotConnected
source: Not connected
zh_cn: 未连接

# Update_FetchingChecksum
source: Fetching checksum file…
zh_cn: 正在获取校验文件…

# Update_ChecksumFormatError
source: Update checksum file format error
zh_cn: 更新校验文件格式异常

# Update_ChecksumDownloadFailed
source: Could not download update checksum file:
zh_cn: 无法下载更新校验文件：

# Update_ChecksumMismatch
source: Update verification failed: SHA256 does not match the server checksum.
zh_cn: 更新包校验失败：SHA256 与服务器公布的不一致。

# Update_Extracting
source: Extracting update…
zh_cn: 正在解压更新包…

# Update_ExtractFailed
source: Update extraction failed:
zh_cn: 更新包解压失败：

# Update_Verifying
source: Verifying update…
zh_cn: 正在验证更新包…

# Update_MissingFiles
source: Update package is invalid: required files are missing.
zh_cn: 更新包内容异常：缺少必要文件。

# Update_VersionMismatch
source: Update version mismatch: expected {0}, got {1}.
zh_cn: 更新包版本不匹配：期望 {0}，实际 {1}。

# Update_MissingUpdater
source: Updater component missing. Please re-download the full installer.
zh_cn: 缺少升级器组件，请重新下载完整安装包。

# Update_PrepRestart
source: Preparing to restart…
zh_cn: 正在准备重启…

# Update_Downloading
source: Downloading {0} … {1:0.0} / {2:0.0} MB
zh_cn: 正在下载 {0} … {1:0.0} / {2:0.0} MB

# Update_DownloadingNoTotal
source: Downloading {0} … {1:0.0} MB
zh_cn: 正在下载 {0} … {1:0.0} MB

# AddRule_EditTitle
source: Edit Rule
zh_cn: 编辑规则

# Error_ExportFailed
source: Export Failed
zh_cn: 导出失败

# Subscription_NeverUpdated
source: Last updated: never
zh_cn: 上次更新: 从未更新

# Subscription_JustNow
source: just now
zh_cn: 刚刚

# Subscription_MinutesAgo
source: {0} min ago
zh_cn: {0} 分钟前

# Subscription_HoursAgo
source: {0} hr ago
zh_cn: {0} 小时前

# Subscription_DaysAgo
source: {0} days ago
zh_cn: {0} 天前

# Subscription_LastUpdated
source: Last updated: {0}
zh_cn: 上次更新: {0}

# Subscription_Expires
source: Expires {0}
zh_cn: 到期 {0}

# Subscription_UpdateAll
source: Update all
zh_cn: 全部更新

# Subscription_UpdatingAll
source: Updating {0}/{1}…
zh_cn: 更新中 {0}/{1}…

# Subscription_Count
source: {0} subscriptions
zh_cn: {0} 个订阅

# Subscription_AutoRefreshSummary
source: Auto update: every {0}h
zh_cn: 自动更新：每 {0} 小时

# ControlPanel_EditPortItem.Text
source: Edit Port
zh_cn: 编辑本地端口

# ControlPanel_ViewLogItem.Text
source: Logs
zh_cn: 查看日志

# ControlPanel_ModeSettings
source: Mode Settings
zh_cn: 模式调节

# ControlPanel_AppSettings
source: App Settings
zh_cn: 软件设置

# ControlPanel_HotkeysItem.Text
source: Hotkeys
zh_cn: 快捷键设置

# ControlPanel_DataManagementItem.Text
source: Data Management
zh_cn: 数据管理

# ControlPanel_OpenDataFolderItem.Text
source: Open Data Folder (Data)
zh_cn: 打开数据文件夹 (Data)

# ControlPanel_ProxySettingsItem.Text
source: Proxy Setting
zh_cn: 代理设置

# ControlPanel_GlobalProxyItem.Text
source: System Proxy
zh_cn: 全局代理

# ControlPanel_GlobalProxyLabel.Text
source: System Proxy
zh_cn: 全局代理

# ControlPanel_GlobalProxySegment.Content
source: System Proxy
zh_cn: 全局代理

# ControlPanel_NoProxyItem.Text
source: Bypass System Proxy
zh_cn: 不接管代理

# ControlPanel_NoProxySegment.Content
source: Bypass System Proxy
zh_cn: 不接管代理

# ControlPanel_StartupItem.Text
source: Startup
zh_cn: 开机启动

# ControlPanel_RoutingSettingsItem.Text
source: Routing
zh_cn: 路由设置

# ControlPanel_RoutingGlobalItem.Text
source: Global
zh_cn: 全局路由

# ControlPanel_RoutingSmartItem.Text
source: Smart
zh_cn: 智能分流

# ControlPanel_CustomRulesItem.Text
source: Custom Rules...
zh_cn: 自定义规则...

# ControlPanel_TunModeLabel.Text
source: TUN Mode
zh_cn: TUN 模式

# ControlPanel_RoutingLbl.Text
source: Routing:
zh_cn: 路由:

# Personalize_LanguageLbl.Text
source: Language & Region
zh_cn: 语言和区域

# ServerList_HeaderText.Text
source: Server List
zh_cn: 服务器列表

# ServerList_AddBtnText.Text
source: Add
zh_cn: 添加

# ServerList_ImportClipboardItem.Text
source: Import from Clipboard
zh_cn: 从剪贴板导入

# ServerList_ImportNodeItem.Text
source: Import Nodes
zh_cn: 导入节点

# ServerList_AddSubscriptionItem.Text
source: Add Subscription
zh_cn: 添加订阅

# ServerList_AddManualItem.Text
source: Add Manually
zh_cn: 手动添加

# ServerList_AddChainProxyItem.Text
source: Chain Proxy
zh_cn: 链式代理

# ServerList_EditText.Text
source: Edit
zh_cn: 编辑

# ServerList_DeleteText.Text
source: Delete
zh_cn: 删除

# ServerList_SearchBox.PlaceholderText
source: Search servers
zh_cn: 搜索服务器

# ServerList_FilterLabelText.Text
source: Filter:
zh_cn: 筛选条件:

# ServerList_SortDefaultItem.Text
source: Default
zh_cn: 默认

# ServerList_SortActiveItem.Text
source: Active
zh_cn: 当前连接

# ServerList_SortProtocolItem.Text
source: Protocol
zh_cn: 协议

# ServerList_SortLatencyItem.Text
source: Latency
zh_cn: 延迟

# ServerList_ActivatedBadge.Text
source: ● Activated
zh_cn: ● 已连接

# ServerList_ChainBadgeText.Text
source: Chain Proxy
zh_cn: 链式代理

# ServerList_Favorites
source: Favorites
zh_cn: 收藏列表

# ServerList_AddFavorite
source: Add to Favorites
zh_cn: 加入收藏

# ServerList_RemoveFavorite
source: Remove from Favorites
zh_cn: 取消收藏

# ServerList_FilterTooltip
source: Group and sort
zh_cn: 分组和排序

# ServerList_SortTooltip
source: Sort
zh_cn: 排序

# ServerList_TestLatencyTooltip
source: Test latency
zh_cn: 测试延迟

# Confirm_DeleteBatchMsg
source: Are you sure you want to delete the selected {0} items?
zh_cn: 确定要删除当前 {0} 个项目?

# Subscription_UnknownError
source: Unknown error
zh_cn: 未知错误

# ServerDetail_HeaderText.Text
source: Server Details
zh_cn: 服务器详情

# ServerDetail_GroupLabel.Text
source: Group
zh_cn: 分组

# ServerDetail_Favorited
source: In the favorites list
zh_cn: 已加入收藏列表

# ServerDetail_ProtocolLabel.Text
source: Protocol
zh_cn: 协议

# ServerDetail_TransportLabel.Text
source: Transport
zh_cn: 传输

# ServerDetail_AiUnlockLabel.Text
source: AI Unlock Status
zh_cn: AI 访问解锁

# ServerDetail_LatencyLabel.Text
source: Latency
zh_cn: 网络延迟

# ServerDetail_Entry
source: Entry
zh_cn: 入口

# ServerDetail_Exit
source: Exit
zh_cn: 出口

# ServerDetail_EntryMissing
source: (entry node missing)
zh_cn: (入口节点缺失)

# ServerDetail_ExitMissing
source: (exit node missing)
zh_cn: (出口节点缺失)

# ServerDetail_AuthLabel
source: Auth
zh_cn: 认证

# ServerDetail_ChainLabel
source: Chain
zh_cn: 链路

# ServerDetail_NoAuth
source: No auth
zh_cn: 无认证

# ServerDetail_UserPass
source: Username/Password
zh_cn: 用户名/密码

# MainWindow_TitleText.Text
source: Proxy Panel
zh_cn: 代理控制台

# CustomRules_RuleListText.Text
source: Rules
zh_cn: 规则列表

# CustomRules_AddBtnText.Text
source: Add
zh_cn: 添加

# CustomRules_NotEffectiveText.Text
source: Global routing is active. Custom rules apply only in Smart Routing.
zh_cn: 当前为全局路由模式，自定义规则不生效。切回智能分流后自动启用。

# CustomRules_SaveBtn.Content
source: Save
zh_cn: 保存

# CustomRules_CancelBtn.Content
source: Cancel
zh_cn: 取消

# CustomRules_AdvancedEditorTooltip
source: Advanced edit (open settings.json externally)
zh_cn: 高级编辑 (用外部编辑器打开 settings.json)

# CustomRules_EditRowTooltip
source: Edit
zh_cn: 编辑

# CustomRules_DeleteRowTooltip
source: Delete
zh_cn: 删除

# CustomRules_PrepFailedTitle
source: Could not prepare settings.json
zh_cn: 无法准备 settings.json

# CustomRules_OpenEditorFailedTitle
source: Could not open editor
zh_cn: 无法打开编辑器

# CustomRules_OpenEditorFailedMsg
source: No .json file association or launch failed: {0}
zh_cn: 未找到 .json 关联程序或启动失败：{0}

# AddRule_TypeLabelText.Text
source: Type
zh_cn: 类型

# AddRule_TypeDomainItem.Content
source: Domain
zh_cn: 域名（Domain）

# AddRule_TypeProcessItem.Content
source: Process
zh_cn: 进程（Process）

# AddRule_MatchLabelText.Text
source: Match Content
zh_cn: 匹配内容

# AddRule_BrowseNameItem.Content
source: Match by name
zh_cn: 匹配同名进程

# AddRule_BrowsePathItem.Content
source: Match by full path
zh_cn: 匹配完整路径

# AddRule_BrowseFolderItem.Content
source: Match entire folder
zh_cn: 匹配整个目录

# AddRule_OutboundLabelText.Text
source: Outbound
zh_cn: 出站

# AddRule_OutboundProxyItem.Content
source: proxy
zh_cn: proxy（代理）

# AddRule_OutboundDirectItem.Content
source: direct
zh_cn: direct（直连）

# AddRule_OutboundBlockItem.Content
source: block
zh_cn: block（阻断）

# AddRule_ErrorTextElem.Text
source: Please enter match content
zh_cn: 请填写匹配内容

# AddRule_BrowseExe
source: Browse exe files...
zh_cn: 选择 exe（可多选）...

# AddRule_BrowseFolder
source: Browse folder...
zh_cn: 浏览文件夹...

# AddRule_PlaceholderDomain
source: One domain or rule per line (e.g. youtube.com or geosite:cn)
zh_cn: 每行一个域名或规则，例如 youtube.com 或 geosite:cn

# AddRule_PlaceholderIp
source: One IP rule per line (e.g. 192.168.0.0/16 or geoip:cn)
zh_cn: 每行一个 IP 规则，例如 192.168.0.0/16 或 geoip:cn

# AddRule_PlaceholderProcess
source: One process name, full path, or folder per line
zh_cn: 每行输入一个进程名、完整路径或文件夹

# AddRule_HintDomain
source: Supports exact match and regexp:/geosite: prefixes. Add one value per line.
zh_cn: 支持精确匹配及 regexp:、geosite: 前缀；每行填写一个值。

# AddRule_HintIp
source: Supports CIDR and geoip: prefixes. Add one value per line.
zh_cn: 支持 CIDR 与 geoip: 前缀；每行填写一个值。

# AddRule_HintProcess
source: One value per line; Browse supports multi-select and removes duplicates.
zh_cn: 每行填写一个值；浏览支持多选，并会自动去重。

# Personalize_AppLanguageTitle.Text
source: Application language
zh_cn: 应用语言

# Personalize_AppLanguageDesc.Text
source: Choose interface language
zh_cn: 选择应用界面的显示语言

# Personalize_LangRestartBar.Title
source: Restart XrayUI to apply changes
zh_cn: 重启应用以应用更改

# Personalize_LangRestartBtn.Content
source: Restart
zh_cn: 重启

# Personalize_ProtocolColorsDesc.Text
source: Customize the color indicator for each protocol
zh_cn: 自定义不同协议的颜色标识

# Personalize_DisplaySettings.Text
source: Display
zh_cn: 显示设置

# Personalize_DetailsHeader.Text
source: Server info display
zh_cn: 服务器信息显示

# Personalize_DetailsDesc.Text
source: Choose what to show on the detail card
zh_cn: 选择详情卡片上的信息展示

# Personalize_DetailLatency.Text
source: Latency
zh_cn: 延迟

# Personalize_DetailLatencyDesc.Text
source: Show latency on the node card
zh_cn: 节点卡片上展示延迟

# Personalize_DetailAiUnlock.Text
source: AI Unlock
zh_cn: AI 解锁

# Personalize_DetailAiUnlockDesc.Text
source: Show AI unlock status on the node card
zh_cn: 节点卡片上展示AI的解锁状态

# Personalize_DetailGroup.Text
source: Group
zh_cn: 分组

# Personalize_DetailGroupDesc.Text
source: Show the subscription group on the node card
zh_cn: 节点卡片上展示所属订阅分组

# Personalize_OpenFilterPanelOnStartup.Text
source: Expand filter bar on startup
zh_cn: 启动时展开筛选栏

# Personalize_OpenFilterPanelOnStartupDesc.Text
source: Show the group and sort options by default
zh_cn: 默认显示分组和排序选项

# Personalize_DisplaySettingsUnsavedBar.Message
source: Applied — click "Done" below to save it
zh_cn: 已生效，记得点击下方「完成」保存

# Personalize_Hotkeys.Text
source: Hotkeys
zh_cn: 快捷键

# Personalize_HotkeysHeader.Text
source: Activation Hotkeys
zh_cn: 激活快捷键

# Personalize_HotkeysDialogTitle
source: Activation Hotkeys
zh_cn: 激活快捷键

# Personalize_HotkeysDesc.Text
source: Quickly trigger common functions using hotkeys
zh_cn: 配置快捷键操作触发常用功能

# Personalize_HotkeyToggleTitle.Text
source: Start/Stop Proxy
zh_cn: 启动/停止代理

# Personalize_HotkeyRestoreTitle.Text
source: Show/Hide Window
zh_cn: 显示/隐藏控制台窗口

# Personalize_HotkeySystemProxyTitle.Text
source: Toggle System Proxy
zh_cn: 切换全局代理

# Personalize_HotkeyTunTitle.Text
source: Toggle TUN Mode
zh_cn: 切换 TUN 模式

# Personalize_HotkeyRoutingTitle.Text
source: Toggle Routing Mode
zh_cn: 切换路由模式

# Personalize_HotkeyImportClipboardTitle.Text
source: Import Nodes from Clipboard
zh_cn: 从剪贴板导入节点

# Personalize_HotkeyNotSet
source: Assign shortcut
zh_cn: 分配快捷方式

# Personalize_HotkeyConflictTitle
source: Failed to Set Hotkey
zh_cn: 快捷键设置失败

# Personalize_HotkeyConflictMsg
source: This combination is already in use by the system or another app — try a different one.
zh_cn: 该组合键已被系统或其他程序占用，请更换一个组合。

# Personalize_HotkeySavedMsg
source: Hotkey is active — click "Done" below to save it
zh_cn: 快捷键已生效，记得点击下方「完成」保存

# Personalize_HotkeyClearedMsg
source: Hotkey cleared — click "Done" below to save it
zh_cn: 快捷键已清除，记得点击下方「完成」保存

# Personalize_HotkeyInvalidTitle
source: Invalid Combination
zh_cn: 组合键无效

# Personalize_HotkeyInvalidMsg
source: Include at least one of Ctrl, Alt, Shift, or Win.
zh_cn: 请至少包含一个 Ctrl、Alt、Shift 或 Win 键。

# Personalize_HotkeyRecordTooltip
source: Click to set a shortcut
zh_cn: 点击设置快捷键

# Personalize_HotkeyToggleAutomationName
source: Start/stop proxy hotkey
zh_cn: 启动/停止代理快捷键

# Personalize_HotkeyRestoreAutomationName
source: Restore window from tray hotkey
zh_cn: 从托盘恢复窗口快捷键

# Personalize_ImportExportTitle.Text
source: Import and Export your data
zh_cn: 配置导入与导出

# Personalize_ImportExportDesc.Text
source: Back up the current nodes and routing rules, or restore from a file
zh_cn: 将当前的节点和路由规则备份到本地，或从已有文件中恢复

# Personalize_ExportBtn.Content
source: Export
zh_cn: 导出
